Конфигурация/InformationRegisters/ОценкиПодготовленностиПоТемам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОценкиПодготовленностиПоТемам</Name>
			<Comment>Срез последних оценок θ обучающихся по темам. Периодический по секунде.</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Тета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SE</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПопыткаТеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Темы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/СобытияАналитики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СобытияАналитики</Name>
			<Comment>Лог событий пользователей для построения аналитических отчетов.</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолезнаяНагрузка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачислениеБаллов</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыдачаБейджа</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзучениеМатериала</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыполнениеПрактическогоЗадания</v8:Type>
						<v8:Type>cfg:DocumentRef.ПопыткаТеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Темы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытийАналитики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючСобытия</Name>
					<Comment>Уникальный ключ записи - разводит события с одинаковыми период/пользователь/тема/тип в пределах одной секунды.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/РейтинговыеПозиции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РейтинговыеПозиции</Name>
			<Comment>Снимок рейтинга обучающихся в учебных группах. Периодический по дню.</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаБаллов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ранг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СредняяТета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УчебнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыПользователей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обучающийся</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Преподаватель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Администратор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ПопыткаТеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПопыткаТеста</Name>
			<Comment>Сессия адаптивного тестирования с пошаговой историей ответов</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Обучающийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Темы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтоговаяОценкаТета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтоговаяSE</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоЗаданий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСессии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ответы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерШага</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТестовыеЗадания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОтвета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстОтвета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Верно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Время</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущаяОценкаТета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущаяSE</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/НачислениеБаллов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НачислениеБаллов</Name>
			<Comment>Хозяйственная операция начисления баллов опыта обучающемуся</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БаллыОпыта</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Обучающийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Темы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныНачисленияБаллов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыдачаБейджа</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзучениеМатериала</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыполнениеПрактическогоЗадания</v8:Type>
						<v8:Type>cfg:DocumentRef.ПопыткаТеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/ВыполнениеПрактическогоЗадания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВыполнениеПрактическогоЗадания</Name>
			<Comment>Фиксация результата выполнения практического задания обучающимся</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Обучающийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрактическиеЗадания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрисоединённоеРешение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПроверки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийПреподавателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтоговыйРезультат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/CommonModules/ОбслуживаниеПользователейВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает элемент справочника Пользователи, соответствующий текущему пользователю ИБ.
// Если интерактивный пользователь ИБ есть, но элемент не найден — создаёт его (бутстрап
// первого администратора).
//
// Возвращаемое значение:
//  СправочникСсылка.Пользователи - текущий пользователь или пустая ссылка.
//
Функция ТекущийПользователь() Экспорт

    ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
    Идентификатор = Строка(ПользовательИБ.УникальныйИдентификатор);

    Если ПустаяСтрока(Идентификатор) Или Идентификатор = "00000000-0000-0000-0000-000000000000" Тогда
        // Нет интерактивного пользователя ИБ (фоновое задание, внешнее соединение и т.п.).
        Возврат Справочники.Пользователи.ПустаяСсылка();
    КонецЕсли;

    Ссылка = НайтиПоИдентификаторуИБ(Идентификатор);
    Если ЗначениеЗаполнено(Ссылка) Тогда
        Возврат Ссылка;
    КонецЕсли;

    Возврат СоздатьПоПользователюИБ(ПользовательИБ);

КонецФункции

// Возвращает вид текущего пользователя — для маршрутизации рабочего стола при старте.
//
// Возвращаемое значение:
//  ПеречислениеСсылка.ВидыПользователей - вид текущего пользователя.
//
Функция ВидТекущегоПользователя() Экспорт

    Ссылка = ТекущийПользователь();
    Если Не ЗначениеЗаполнено(Ссылка) Тогда
        Возврат Перечисления.ВидыПользователей.Обучающийся;
    КонецЕсли;
    Возврат ОбщегоНазначенияСерверПриложение.ЗначениеРеквизитаОбъекта(Ссылка, "Вид");

КонецФункции

// Создаёт или обновляет пользователя ИБ для элемента справочника Пользователи и
// записывает в объект идентификатор/имя пользователя ИБ. Вызывается из ПередЗаписью объекта
// (направление обмена «справочник → ИБ»).
//
// Параметры:
//  ПользовательОбъект - СправочникОбъект.Пользователи - записываемый элемент.
//  Пароль             - Строка, Неопределено          - новый пароль (если задан).
//
Процедура СинхронизироватьСПользователемИБ(ПользовательОбъект, Знач Пароль = Неопределено) Экспорт

    Если ПользовательОбъект.Недействителен Тогда
        Возврат;
    КонецЕсли;

    Логин = СокрЛП(ПользовательОбъект.ИмяПользователяИБ);
    Если ПустаяСтрока(Логин) Тогда
        Логин = ЛогинПоУмолчанию(ПользовательОбъект.Наименование);
        ПользовательОбъект.ИмяПользователяИБ = Логин;
    КонецЕсли;

    Идентификатор = СокрЛП(ПользовательОбъект.ИдентификаторПользователяИБ);
    ПользовательИБ = Неопределено;
    Если Не ПустаяСтрока(Идентификатор) Тогда
        ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
            Новый УникальныйИдентификатор(Идентификатор));
    КонецЕсли;
    Если ПользовательИБ = Неопределено Тогда
        ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
    КонецЕсли;

    ПользовательИБ.Имя                       = Логин;
    ПользовательИБ.ПолноеИмя                 = ПользовательОбъект.Наименование;
    ПользовательИБ.АутентификацияСтандартная = Истина;
    Если Пароль <> Неопределено Тогда
        ПользовательИБ.Пароль = Пароль;
    КонецЕсли;
    ПользовательИБ.Записать();

    ПользовательОбъект.ИдентификаторПользователяИБ = Строка(ПользовательИБ.УникальныйИдентификатор);

КонецПроцедуры

// Создаёт недостающие элементы справочника Пользователи по списку пользователей ИБ
// (обратное направление обмена «ИБ → справочник»).
//
// Возвращаемое значение:
//  Число - количество созданных элементов.
//
Функция СинхронизироватьВсехСПользователямиИБ() Экспорт

    Создано = 0;
    Для Каждого ПользовательИБ Из ПользователиИнформационнойБазы.ПолучитьПользователей() Цикл
        Идентификатор = Строка(ПользовательИБ.УникальныйИдентификатор);
        Если ЗначениеЗаполнено(НайтиПоИдентификаторуИБ(Идентификатор)) Тогда
            Продолжить;
        КонецЕсли;
        СоздатьПоПользователюИБ(ПользовательИБ);
        Создано = Создано + 1;
    КонецЦикла;
    Возврат Создано;

КонецФункции

// Находит пользователя по наименованию (ФИО); при отсутствии создаёт с заданным видом.
// Используется при наполнении эталонными данными, где идентичность задана только ФИО
// (нет логина/идентификатора пользователя ИБ).
//
// Параметры:
//  ФИО - Строка                              - наименование (ФИО) искомого пользователя.
//  Вид - ПеречислениеСсылка.ВидыПользователей - вид создаваемого пользователя
//        (по умолчанию Обучающийся).
//
// Возвращаемое значение:
//  СправочникСсылка.Пользователи - найденный или созданный элемент, либо пустая ссылка.
//
Функция НайтиИлиСоздатьПоФИО(Знач ФИО, Знач Вид = Неопределено) Экспорт

    ФИО = СокрЛП(ФИО);
    Если ПустаяСтрока(ФИО) Тогда
        Возврат Справочники.Пользователи.ПустаяСсылка();
    КонецЕсли;

    Запрос = Новый Запрос(
        "ВЫБРАТЬ ПЕРВЫЕ 1
        |   Пользователи.Ссылка КАК Ссылка
        |ИЗ
        |   Справочник.Пользователи КАК Пользователи
        |ГДЕ
        |   Пользователи.Наименование = &Наименование");
    Запрос.УстановитьПараметр("Наименование", ФИО);
    Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Ссылка;
    КонецЕсли;

    Если Вид = Неопределено Тогда
        Вид = Перечисления.ВидыПользователей.Обучающийся;
    КонецЕсли;
    Объект = Справочники.Пользователи.СоздатьЭлемент();
    Объект.Наименование = Лев(ФИО, 150);
    Объект.Вид = Вид;
    Объект.ОбменДанными.Загрузка = Истина; // нет логина ИБ — пропустить синхронизацию ПередЗаписью
    Объект.Записать();
    Возврат Объект.Ссылка;

КонецФункции

// Запускает демонстрационное наполнение базы. Предназначена для пакетного режима
// (запуск приложения с параметром SEED_DEMO, см. модуль управляемого приложения).
//
// Параметры:
//  КаталогФикстур  - Строка - путь к каталогу fixtures.
//  ФайлРезультата  - Строка - путь к файлу для записи результата (может быть пустым).
//
// Возвращаемое значение:
//  Строка - текстовое описание результата наполнения.
//
Функция ВыполнитьДемоНаполнениеНаСервере(Знач КаталогФикстур, Знач ФайлРезультата = "") Экспорт

    Обработка = Обработки.ПервоначальноеНаполнение.Создать();
    Результат = Обработка.ВыполнитьДемоНаполнение(КаталогФикстур);
    Сообщение = СтрШаблон(
        "Демо-наполнение: студентов = %1, сессий = %2, ошибка = [%3]. Учетные записи: %4",
        Результат.Студенты, Результат.Сессии, Результат.Ошибка, Результат.Логины);

    Если Не ПустаяСтрока(ФайлРезультата) Тогда
        Попытка
            Запись = Новый ЗаписьТекста(ФайлРезультата, КодировкаТекста.UTF8);
            Запись.ЗаписатьСтроку(Сообщение);
            Запись.Закрыть();
        Исключение
            ОбщегоНазначенияСерверПриложение.ЗафиксироватьСбой(
                "ВыполнитьДемоНаполнениеНаСервере", ОписаниеОшибки());
        КонецПопытки;
    КонецЕсли;

    Возврат Сообщение;

КонецФункции

// Диагностика: возвращает счетчики ключевых таблиц демо-данных и пишет их в файл.
//
Функция ДемоСтатистикаНаСервере(Знач ФайлРезультата = "") Экспорт

    Счетчики = Новый Массив;
    Счетчики.Добавить("Группы=" + Строка(ЧислоЗаписей("ВЫБРАТЬ КОЛИЧЕСТВО(*) КАК К ИЗ Справочник.УчебныеГруппы")));
    Счетчики.Добавить("Пользователи=" + Строка(ЧислоЗаписей("ВЫБРАТЬ КОЛИЧЕСТВО(*) КАК К ИЗ Справочник.Пользователи")));
    Счетчики.Добавить("ПопыткиТеста=" + Строка(ЧислоЗаписей("ВЫБРАТЬ КОЛИЧЕСТВО(*) КАК К ИЗ Документ.ПопыткаТеста")));
    Счетчики.Добавить("НачисленияБаллов=" + Строка(ЧислоЗаписей("ВЫБРАТЬ КОЛИЧЕСТВО(*) КАК К ИЗ Документ.НачислениеБаллов")));
    Счетчики.Добавить("ВыдачиБейджей=" + Строка(ЧислоЗаписей("ВЫБРАТЬ КОЛИЧЕСТВО(*) КАК К ИЗ Документ.ВыдачаБейджа")));
    Счетчики.Добавить("ОценкиТеты=" + Строка(ЧислоЗаписей("ВЫБРАТЬ КОЛИЧЕСТВО(*) КАК К ИЗ РегистрСведений.ОценкиПодготовленностиПоТемам")));
    Счетчики.Добавить("СобытияАналитики=" + Строка(ЧислоЗаписей("ВЫБРАТЬ КОЛИЧЕСТВО(*) КАК К ИЗ РегистрСведений.СобытияАналитики")));
    Счетчики.Добавить("РейтинговыеПозиции=" + Строка(ЧислоЗаписей("ВЫБРАТЬ КОЛИЧЕСТВО(*) КАК К ИЗ РегистрСведений.РейтинговыеПозиции")));
    Счетчики.Добавить("ПрактическиеЗадания=" + Строка(ЧислоЗаписей("ВЫБРАТЬ КОЛИЧЕСТВО(*) КАК К ИЗ Справочник.ПрактическиеЗадания")));
    Счетчики.Добавить("ВыполненияПЗ=" + Строка(ЧислоЗаписей("ВЫБРАТЬ КОЛИЧЕСТВО(*) КАК К ИЗ Документ.ВыполнениеПрактическогоЗадания")));
    Счетчики.Добавить("ВыполненияПЗпроверено=" + Строка(ЧислоЗаписей("ВЫБРАТЬ КОЛИЧЕСТВО(*) КАК К ИЗ Документ.ВыполнениеПрактическогоЗадания ГДЕ СтатусПроверки <> """"")));
    Счетчики.Добавить("Темы=" + Строка(ЧислоЗаписей("ВЫБРАТЬ КОЛИЧЕСТВО(*) КАК К ИЗ Справочник.Темы")));
    Счетчики.Добавить("МатериалыБиблиотеки=" + Строка(ЧислоЗаписей("ВЫБРАТЬ КОЛИЧЕСТВО(*) КАК К ИЗ Справочник.МатериалыБиблиотеки")));
    Счетчики.Добавить("Курсы=" + Строка(ЧислоЗаписей("ВЫБРАТЬ КОЛИЧЕСТВО(*) КАК К ИЗ Справочник.Курсы")));
    Счетчики.Добавить("ТестовыеЗадания=" + Строка(ЧислоЗаписей("ВЫБРАТЬ КОЛИЧЕСТВО(*) КАК К ИЗ Справочник.ТестовыеЗадания")));
    Счетчики.Добавить("ПараметрыIRT=" + Строка(ЧислоЗаписей("ВЫБРАТЬ КОЛИЧЕСТВО(*) КАК К ИЗ РегистрСведений.ПараметрыIRT")));

    ПользователиИБ = "";
    Для Каждого П Из ПользователиИнформационнойБазы.ПолучитьПользователей() Цикл
        Роли = "";
        Для Каждого Р Из П.Роли Цикл
            Роли = Роли + ?(ПустаяСтрока(Роли), "", "+") + Р.Имя;
        КонецЦикла;
        ПользователиИБ = ПользователиИБ + П.Имя + "[" + Роли + "] ";
    КонецЦикла;
    Счетчики.Добавить("ПользователиИБ: " + ПользователиИБ);

    Сообщение = СтрСоединить(Счетчики, "; ");
    Если Не ПустаяСтрока(ФайлРезультата) Тогда
        Попытка
            Запись = Новый ЗаписьТекста(ФайлРезультата, КодировкаТекста.UTF8);
            Запись.ЗаписатьСтроку(Сообщение);
            Запись.Закрыть();
        Исключение
        КонецПопытки;
    КонецЕсли;
    Возврат Сообщение;

КонецФункции

// Диагностика: формирует JSON дашбордов обучающегося (логин student) и преподавателя
// и пишет их в два файла. Возвращает краткую сводку размеров секций.
//
Функция ДемоДашбордыНаСервере(Знач ФайлСтудент = "", Знач ФайлПреподаватель = "") Экспорт

    Итог = Новый Массив;

    // Студент - элемент справочника, привязанный к пользователю ИБ "student".
    Студент = Справочники.Пользователи.ПустаяСсылка();
    Для Каждого ПИБ Из ПользователиИнформационнойБазы.ПолучитьПользователей() Цикл
        Если ПИБ.Имя = "student" Тогда
            Запрос = Новый Запрос(
                "ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник.Пользователи
                |ГДЕ ИдентификаторПользователяИБ = &Ид");
            Запрос.УстановитьПараметр("Ид", Строка(ПИБ.УникальныйИдентификатор));
            Выб = Запрос.Выполнить().Выбрать();
            Если Выб.Следующий() Тогда
                Студент = Выб.Ссылка;
            КонецЕсли;
            Прервать;
        КонецЕсли;
    КонецЦикла;

    Сегодня = НачалоДня(ТекущаяДатаСеанса());
    Период = Новый Структура("Начало, Окончание", Сегодня - 30 * 86400, КонецДня(Сегодня));

    Если ЗначениеЗаполнено(Студент) Тогда
        JSONСтудент = ДанныеДашборда.СформироватьДашбордОбучающегося(Студент, Период);
        ЗаписатьФайл(ФайлСтудент, JSONСтудент);
        Итог.Добавить("СтудентJSON=" + Строка(СтрДлина(JSONСтудент)) + "симв (" + Строка(Студент) + ")");
    Иначе
        Итог.Добавить("СтудентJSON=НЕ НАЙДЕН");
    КонецЕсли;

    Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник.УчебныеГруппы УПОРЯДОЧИТЬ ПО Наименование");
    Выб = Запрос.Выполнить().Выбрать();
    Если Выб.Следующий() Тогда
        JSONПреп = ДанныеДашборда.СформироватьДашбордПреподавателя(Выб.Ссылка, Период);
        ЗаписатьФайл(ФайлПреподаватель, JSONПреп);
        Итог.Добавить("ПреподавательJSON=" + Строка(СтрДлина(JSONПреп)) + "симв");
    Иначе
        Итог.Добавить("ПреподавательJSON=НЕТ ГРУППЫ");
    КонецЕсли;

    // Проверка генерации дашборда библиотеки.
    Попытка
        HTMLБибл = Отчеты.ДашбордБиблиотеки.ПолучитьМакетКакСтроку();
        ЕстьДанные = СтрНайти(HTMLБибл, "ВсегоМатериалов") > 0;
        Итог.Добавить("БиблиотекаHTML=" + Строка(СтрДлина(HTMLБибл)) + "симв" + ?(ЕстьДанные, " (с данными)", " (БЕЗ данных!)"));
    Исключение
        Итог.Добавить("БиблиотекаHTML=ОШИБКА: " + ОписаниеОшибки());
    КонецПопытки;

    // Проверка генерации HTML-отчета по сессии (была ошибка сериализации ссылки).
    Попытка
        ЗапросС = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Документ.ПопыткаТеста ГДЕ СтатусСессии = ""Завершена""");
        ВыбС = ЗапросС.Выполнить().Выбрать();
        Если ВыбС.Следующий() Тогда
            HTMLОтчет = Отчеты.ОтчётПоПрохождениюТеста.ПолучитьМакетКакСтроку(ВыбС.Ссылка);
            Итог.Добавить("ОтчетПоТестуHTML=" + Строка(СтрДлина(HTMLОтчет)) + "симв (ОК)");
        КонецЕсли;
    Исключение
        Итог.Добавить("ОтчетПоТестуHTML=ОШИБКА: " + ОписаниеОшибки());
    КонецПопытки;

    Возврат СтрСоединить(Итог, "; ");

КонецФункции

Процедура ЗаписатьФайл(Знач Путь, Знач Текст)

    Если ПустаяСтрока(Путь) Тогда
        Возврат;
    КонецЕсли;
    Попытка
        Запись = Новый ЗаписьТекста(Путь, КодировкаТекста.UTF8);
        Запись.ЗаписатьСтроку(Текст);
        Запись.Закрыть();
    Исключение
    КонецПопытки;

КонецПроцедуры

// Диагностика RLS: число видимых текущему пользователю попыток теста и его роль.
//
Функция ПроверкаRLSНаСервере(Знач ФайлРезультата = "") Экспорт

    Текущий = "?";
    Попытка
        Текущий = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
    Исключение
    КонецПопытки;

    Видимых = ЧислоЗаписей("ВЫБРАТЬ КОЛИЧЕСТВО(*) КАК К ИЗ Документ.ПопыткаТеста");
    Сообщение = "Пользователь=" + Текущий + "; ВидимыхПопытокТеста=" + Строка(Видимых);

    Если Не ПустаяСтрока(ФайлРезультата) Тогда
        Попытка
            Запись = Новый ЗаписьТекста(ФайлРезультата, КодировкаТекста.UTF8);
            Запись.ЗаписатьСтроку(Сообщение);
            Запись.Закрыть();
        Исключение
        КонецПопытки;
    КонецЕсли;
    Возврат Сообщение;

КонецФункции

Функция ЧислоЗаписей(Знач ТекстЗапроса)

    Запрос = Новый Запрос(ТекстЗапроса);
    Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда
        Возврат Выборка.К;
    КонецЕсли;
    Возврат 0;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Ищет элемент справочника Пользователи по идентификатору пользователя ИБ.
//
// Параметры:
//  Идентификатор - Строка - UUID пользователя ИБ.
//
// Возвращаемое значение:
//  СправочникСсылка.Пользователи - найденный элемент или пустая ссылка.
//
Функция НайтиПоИдентификаторуИБ(Знач Идентификатор)

    Запрос = Новый Запрос(
        "ВЫБРАТЬ ПЕРВЫЕ 1
        |   Пользователи.Ссылка КАК Ссылка
        |ИЗ
        |   Справочник.Пользователи КАК Пользователи
        |ГДЕ
        |   Пользователи.ИдентификаторПользователяИБ = &Идентификатор");
    Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
    Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Ссылка;
    КонецЕсли;
    Возврат Справочники.Пользователи.ПустаяСсылка();

КонецФункции

// Создаёт элемент справочника Пользователи по пользователю ИБ. Первый созданный
// пользователь получает вид «Администратор», остальные — «Обучающийся».
//
// Параметры:
//  ПользовательИБ - ПользовательИнформационнойБазы - пользователь ИБ.
//
// Возвращаемое значение:
//  СправочникСсылка.Пользователи - созданный элемент.
//
Функция СоздатьПоПользователюИБ(Знач ПользовательИБ)

    Объект = Справочники.Пользователи.СоздатьЭлемент();
    Наименование = ПользовательИБ.ПолноеИмя;
    Если ПустаяСтрока(Наименование) Тогда
        Наименование = ПользовательИБ.Имя;
    КонецЕсли;
    Объект.Наименование                = Наименование;
    Объект.ИмяПользователяИБ           = ПользовательИБ.Имя;
    Объект.ИдентификаторПользователяИБ = Строка(ПользовательИБ.УникальныйИдентификатор);
    Объект.Вид = ?(СправочникПуст(),
        Перечисления.ВидыПользователей.Администратор,
        Перечисления.ВидыПользователей.Обучающийся);
    // Пользователь ИБ уже существует — обмен «справочник → ИБ» в ПередЗаписью пропускаем.
    Объект.ОбменДанными.Загрузка = Истина;
    Объект.Записать();
    Возврат Объект.Ссылка;

КонецФункции

// Возвращает Истина, если справочник Пользователи ещё не содержит элементов.
//
// Возвращаемое значение:
//  Булево - признак пустого справочника.
//
Функция СправочникПуст()

    Запрос = Новый Запрос(
        "ВЫБРАТЬ ПЕРВЫЕ 1
        |   Пользователи.Ссылка
        |ИЗ
        |   Справочник.Пользователи КАК Пользователи");
    Возврат Запрос.Выполнить().Пустой();

КонецФункции

// Формирует логин по умолчанию из наименования (ФИО) — пробелы заменяются подчёркиванием.
//
// Параметры:
//  Наименование - Строка - ФИО пользователя.
//
// Возвращаемое значение:
//  Строка - логин для пользователя ИБ.
//
Функция ЛогинПоУмолчанию(Знач Наименование)

    Логин = СтрЗаменить(СокрЛП(Наименование), " ", "_");
    Если ПустаяСтрока(Логин) Тогда
        Логин = "Пользователь";
    КонецЕсли;
    Возврат Логин;

КонецФункции

#КонецОбласти
